
## Plan Result (prod)




<pre><code>Plan: 3 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * module.lau-case-db-flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.lau-case-db-flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
  * module.lau-case-db-flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;lau_case&#34;]
* Update
  * azurerm_key_vault_secret.POSTGRES_HOST
  * module.lau-case-db-flexible.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.lau-case-db-flexible.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.lau-case-db-flexible.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES_HOST will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
        id                      = "https://lau-prod.vault.azure.net/secrets/case-backend-POSTGRES-HOST/103890a456774e1f82b1f447dcf62324"
        name                    = "case-backend-POSTGRES-HOST"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # module.lau-case-db-flexible.azurerm_monitor_metric_alert.db_alert_cpu[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/lau-case-backend-flexible-data-prod/providers/Microsoft.Insights/metricAlerts/db_cpu_percent_lau-case-backend-flexible-prod"
        name                     = "db_cpu_percent_lau-case-backend-flexible-prod"
      ~ scopes                   = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/lau-case-backend-flexible-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/lau-case-backend-flexible-prod",
        ] -> (known after apply)
        tags                     = {
            "application"         = "log-and-audit"
            "builtFrom"           = "https://github.com/HMCTS/lau-case-backend.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#lau-dev"
            "environment"         = "production"
            "managedBy"           = "LAU"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.lau-case-db-flexible.azurerm_monitor_metric_alert.db_alert_memory[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_memory" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/lau-case-backend-flexible-data-prod/providers/Microsoft.Insights/metricAlerts/db_memory_percent_lau-case-backend-flexible-prod"
        name                     = "db_memory_percent_lau-case-backend-flexible-prod"
      ~ scopes                   = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/lau-case-backend-flexible-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/lau-case-backend-flexible-prod",
        ] -> (known after apply)
        tags                     = {
            "application"         = "log-and-audit"
            "builtFrom"           = "https://github.com/HMCTS/lau-case-backend.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#lau-dev"
            "environment"         = "production"
            "managedBy"           = "LAU"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.lau-case-db-flexible.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/lau-case-backend-flexible-data-prod/providers/Microsoft.Insights/metricAlerts/db_storage_utilization_lau-case-backend-flexible-prod"
        name                     = "db_storage_utilization_lau-case-backend-flexible-prod"
      ~ scopes                   = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/lau-case-backend-flexible-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/lau-case-backend-flexible-prod",
        ] -> (known after apply)
        tags                     = {
            "application"         = "log-and-audit"
            "builtFrom"           = "https://github.com/HMCTS/lau-case-backend.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#lau-dev"
            "environment"         = "production"
            "managedBy"           = "LAU"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.lau-case-db-flexible.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "lauadmin"
      + administrator_password        = (sensitive value)
      + administrator_password_wo     = (write-only attribute)
      + auto_grow_enabled             = true
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "lau-case-backend-flexible-prod"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = false
      + resource_group_name           = "lau-case-backend-flexible-data-prod"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 524288
      + storage_tier                  = (known after apply)
      + tags                          = {
          + "application"         = "log-and-audit"
          + "builtFrom"           = "https://github.com/HMCTS/lau-case-backend.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#lau-dev"
          + "environment"         = "production"
          + "managedBy"           = "LAU"
        }
      + version                       = "15"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.lau-case-db-flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "azure.extensions"
      + server_id = (known after apply)
      + value     = "pg_stat_statements,pg_buffercache,pgcrypto,hypopg"
    }

  # module.lau-case-db-flexible.azurerm_postgresql_flexible_server_database.pg_databases["lau_case"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "lau_case"
      + server_id = (known after apply)
    }

Plan: 3 to add, 4 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1035,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->